---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureWAngle
source: html/2b324173-380a-4152-c39d-62b43663e543.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureWAngle Property

The property labeled "Rotation" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureWAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 360".